/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   auto-curry.ts                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: honlee <honlee@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/06/01 10:23:59 by honlee            #+#    #+#             */
/*   Updated: 2021/06/01 10:26:16 by honlee           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

import * as R from 'ramda'

// 람다 라이브러리의 함수들은 매개변수가 두개인 일반 함수처럼 사용할 수도 있고,
// 2차 고차함수로 사용 할 수도 있습니다. 람다 라이브러리에서는 이를 자동커리(auto curry) 라고 합니다.

console.log(
	R.add(1, 2),
	R.add(1)(2)
)