/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   curriedSum.ts                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: honlee <honlee@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/06/01 10:38:36 by honlee            #+#    #+#             */
/*   Updated: 2021/06/01 10:45:30 by honlee           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

import * as R from 'ramda'
import { sum } from './sum'

// R.curryN 함수는 N개의 매개변수를 가진 1차함수 (first function)을 N개의 커리(curry)매개변수
// 를 가지는 N차 고차함수로 만들어 줍니다.

export const curriedSum = R.curryN(4, sum)