/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   range-tap.ts                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: honlee <honlee@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/05/31 22:37:08 by honlee            #+#    #+#             */
/*   Updated: 2021/05/31 22:39:04 by honlee           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

import * as R from 'ramda'

// R.tap(콜백함수)(배열)

const numbers:number[] = R.range(1, 9 + 1)
R.tap((n:number[]):void => console.log(n))(numbers)
