/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   range-tap-pipe.ts                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: honlee <honlee@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/05/31 22:41:06 by honlee            #+#    #+#             */
/*   Updated: 2021/05/31 22:44:12 by honlee           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

import * as R from 'ramda'

// 람다는 compose 와 pipe 함수를 제공합니다. 그런데 로직을 구현 할 때는 R.pipe 함수가 이해하기 더 편합니다.
// 결합된 함수는 왼쪽에서부터 오른쪽으로 실행된다.

const array: number[] = R.range(1, 9 + 1)

R.pipe(
	R.tap((n:number[]):void => console.log(n))
)(array)

