/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pureSort.ts                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: honlee <honlee@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/05/27 21:27:10 by honlee            #+#    #+#             */
/*   Updated: 2021/05/27 21:28:34 by honlee           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//sort 는 배열을 오염시킨다. (배열 자체를 정렬하기 때문)

export const pureSort = <T>(array: readonly T[]) : T[] =>{
	let deepCopied = [...array]
	return (deepCopied.sort())
}